//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Väärä käyttäjätunnus tai salasana";
"_cancelled_by_user"                    = "Siirto peruttu";
"_error_folder_destiny_is_the_same_"    = "Kansiota ei voi siirtää itseensä ";
"_error_not_permission_"                = "Sinulla ei ole oikeuksia toteuttaa tätä toimintoa";
"_error_path_"                          = "Tiedoston tai kansion avaaminen epäonnistui. Varmista, että se on olemassa";
"_file_upload_not_exitst_"              = "Lähetettävää tiedostoa ei ole olemassa";
"_forbidden_characters_from_server_"    = "Nimi sisältää vähintään yhden virheellisen merkin";
"_not_connected_internet_"              = "Palvelimen yhteysvirhe";
"_not_possible_connect_to_server_"      = "Palvelimeen ei juuri nyt saatu yhteyttä";
"_not_possible_create_folder_"          = "Kansion luominen epäonnistui";
"_server_down_"                         = "Yhteyden muodostaminen palvelimeen ei onnistu ";
"_time_out_"                            = "Aikakatkaisu, yritä uudelleen";
"_unknow_response_server_"              = "Odottamaton vastaus palvelimelta";
"_user_autentication_required_"         = "Käyttäjätunnistautuminen vaaditaan";
"_file_directory_locked_"               = "Tiedosto tai hakemisto on lukittu";
"_ssl_certificate_untrusted_"           = "Palvelimen sertifikaatti on virheellinen";
"_internal_server_"                     = "Sisäinen palvelinvirhe";
"_file_already_exists_"                 = "Toiminto epäonnistui, koska samanniminen tiedosto on jo olemassa";
"_file_folder_not_exists_"              = "Lähdetiedostoa ei löytynyt määritellystä sijainnista";
"_folder_contents_nochanged_"           = "Kansion sisältö ei ole muuttunut";
"_images_invalid_converted_"            = "Kuva on virheellinen, eikä siitä voi luoda esikatselukuvaa";
"_method_not_expected_"                 = "Odottamaton pyyntömetodi";
"_reauthenticate_user_"                 = "Access expired, log in again";
"_server_error_retry_"                  = "Palvelin on tilapäisesti pois käytöstä";
"_too_many_files_"                      = "Too many files would be involved in this operation";
"_too_many_request_"                    = "Sending too many requests caused the rate limit to be reached";
"_user_over_quota_"                     = "Levytila saavutettu";
"_ssl_connection_error_"                = "SSL-yhteysvirhe, yritä uudelleen";
"_bad_request_"                         = "Virheellinen pyyntö";
"_webdav_locked_"                       = "WebDAV Locked: Trying to access locked resource";
"_error_user_not_available_"            = "Käyttäjä ei ole enää tavoitettavissa";
"_server_response_error_"               = "Palvelinvastauksen sisältövirhe";


